wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
/*    External step generator and IO interface for LinuxCNC over Ethernet
 *    with dual-core ESP32 and built-in Ethernet RMIi PHY LAN8270 or SPI Ethernet W5500 modules
 *
 *    Copyright 2024 Wez Hunter <wez at hunter.to>
 *    Copyright 2022 Juhász Zoltán <juhasz.zoltan at freemail dot hu> (Original HAL2UDP project that this was based on but firmware no longer resembles much of it)
 * 
 *    version:20240119
 *
 *    This program is free software; you can redistribute it and/or modify
 *    it under the terms of the GNU General Public License as published by
 *    the Free Software Foundation; either version 2 of the License, or
 *    (at your option) any later version.
 *
 *    This program is distributed in the hope that it will be useful,
 *    but WITHOUT ANY WARRANTY; without even the implied warranty of
 *    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *    GNU General Public License for more details.
 *
 *    You should have received a copy of the GNU General Public License
 *    along with this program; if not, write to the Free Software
 *    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

/*    Hardware: TODO document all hardware, pins and available mappings for each use-case
 *
 *    ESP32-WROOM or WROVER modules - Two Cores 240Mhz each. 
 *    8 channel RMT peripheral so can drive 8 stepper motors with RMT peripheral hardware up-to 200khz total with native IO. 
 *    The MCPWM or PCNT (Pulse Counter) hardware peripherals are NOT used therefore leaving them free for hardware pulse counting Servo Encoder tracking later
 *    https://github.com/gin66/FastAccelStepper/tree/master?tab=readme-ov-file#overview
 *    https://github.com/gin66/FastAccelStepper/tree/master?tab=readme-ov-file#esp32-2
 *    
 * 
 *    Software setup - 
 *    Core 1 - Arduino loops, OTA Updates and Serial Stats Task (disable in config as needed - no impact measured if left enabled)
 *    Core 0 - Ethernet, UDP Client & Server, Motor commands, Servo Step Gen, Input handler Task, Telnet server
 *      
 *    GPIO pins - see hardware docs for each board and map pins to your needs. All settings in Config.h. Motor STEP pins must be on native GPIO not on a I2C/I2S bus for RMT peripheral to work. Everything else is free reign.
 *
 */


#include <Arduino.h>
#include "FastAccelStepper.h"
#include "Config.h"
#include "Types.hpp"

#ifdef ARDUINO_ESP32_MKS_DLC32
    #include "Pins.h"
    #include "I2SOut.h"
#endif

#include <WiFi.h>        // For connecting ESP32 to WiFi
#include <ArduinoOTA.h>  // For enabling over-the-air updates via network either WiFi or Ethernet

#include <esp_timer.h>
#include "soc/rtc_wdt.h"
#include <esp_task_wdt.h>
#include "esp32-hal-log.h"

#ifdef ESP32_RMII_ETHERNET
    #include <ETH.h>
#elif defined(ESP32SX_USB_ETHERNET) // TODO - WIP
    //#include "bsp/board_api.h"
    // #include "tusb.h"
    // #include "dhserver.h"
    // #include "dnserver.h"
    #include "lwip/init.h"
    #include "lwip/timeouts.h"
    //#include "lwip/ethip6.h"
#elif defined(ESP32_SPI_ETHERNET) 
    #include <AsyncUDP_ESP32_Ethernet.h>
#endif


/*==================================================================*/
FastAccelStepperEngine stepperEngine = FastAccelStepperEngine();
hw_timer_t * timerServoCmds = NULL;

EventGroupHandle_t  xEventUdpReceiveGroup;
xQueueHandle IRAM_ATTR inputInterruptQueue;
xQueueHandle IRAM_ATTR axisStateInterruptQueue;
/*==================================================================*/
bool eth_connected = false;

uint8_t spinProgress = 0;
char spinChar = '|';

/*==================================================================*/

#if (OUT_00_PIN != GPIO_NUM_NC)
#undef OUT_00_H
#define OUT_00_H digitalWrite(OUT_00_PIN, HIGH)
#endif
#if (OUT_00_PIN != GPIO_NUM_NC)
#undef OUT_00_L
#define OUT_00_L digitalWrite(OUT_00_PIN, LOW)
#endif

#if (OUT_01_PIN != GPIO_NUM_NC)
#undef OUT_01_H
#define OUT_01_H digitalWrite(OUT_01_PIN, HIGH)
#endif
#if (OUT_01_PIN != GPIO_NUM_NC)
#undef OUT_01_L
#define OUT_01_L digitalWrite(OUT_01_PIN, LOW)
#endif

#if (OUT_02_PIN != GPIO_NUM_NC)
#undef OUT_02_H
#define OUT_02_H digitalWrite(OUT_02_PIN, HIGH)
#endif
#if (OUT_02_PIN != GPIO_NUM_NC)
#undef OUT_02_L
#define OUT_02_L digitalWrite(OUT_02_PIN, LOW)
#endif
#if (OUT_03_PIN != GPIO_NUM_NC)
#undef OUT_03_H
#define OUT_03_H digitalWrite(OUT_03_PIN, HIGH)
#endif
#if (OUT_03_PIN != GPIO_NUM_NC)
#undef OUT_03_L
#define OUT_03_L digitalWrite(OUT_03_PIN, LOW)
#endif
#if (OUT_04_PIN != GPIO_NUM_NC)
#undef OUT_04_H
#define OUT_04_H digitalWrite(OUT_04_PIN, HIGH)
#endif
#if (OUT_04_PIN != GPIO_NUM_NC)
#undef OUT_04_L
#define OUT_04_L digitalWrite(OUT_04_PIN, LOW)
#endif
#if (OUT_05_PIN != GPIO_NUM_NC)
#undef OUT_05_H
#define OUT_05_H digitalWrite(OUT_05_PIN, HIGH)
#endif
#if (OUT_05_PIN != GPIO_NUM_NC)
#undef OUT_05_L
#define OUT_05_L digitalWrite(OUT_05_PIN, LOW)
#endif

/*==================================================================*/

#ifdef ESP32_RMII_ETHERNET
    #include "AsyncUDP.h"
    #include "AsyncTCP.h"
    AsyncUDP udpClient;
    AsyncUDP udpServer;
    AsyncServer telnetServer(23);
#elif defined(ESP32SX_USB_ETHERNET) // TODO - WIP
    #include "AsyncUDP.h"
    #include "AsyncTCP.h"
    //#include <SoftwareSerial.h>
    AsyncUDP udpClient;
    AsyncUDP udpServer;
    AsyncServer telnetServer(23);
#elif defined(ESP32_SPI_ETHERNET)
    AsyncUDP udpClient;
    AsyncUDP udpServer;
    AsyncServer telnetServer(23);
#endif



volatile uint32_t udp_tx_seq_num = 0;
volatile uint32_t udp_rx_seq_num = 0;

uint8_t inputPinInterruptFired[MAX_INPUTS] = { 0 };

cmdPacket cmd = { 0 };
fbPacket fb = { 0 };

volatile uint8_t prev_cmd_control = 0;

volatile unsigned long ul_dirSetup[MAX_STEPPER] = { 1000 }; 
/*==================================================================*/

FastAccelStepper *stepper[CONF_NUM_STEPPERS];
volatile uint8_t prevRampState[MAX_STEPPER] = {0}; // Reserved for future use

const double axisVelScaleFactor = 1.02; // Reduce max accel of motors by 2% to ensure FAS command position buffer remains full

volatile bool runLoops = false;

const int8_t pwm_pin[MAX_OUTPUTS] = { OUT_00_PIN, OUT_01_PIN, OUT_02_PIN, OUT_03_PIN, OUT_04_PIN, OUT_05_PIN };
bool pwm_enable[MAX_OUTPUTS] = { false, false, false, false, false, false };

long lastMsg_ProfileStats = 0;

uint8_t prev_ctrl_ready = false;

volatile bool motorsSetup = false;
volatile bool machineEnabled = false;
volatile bool motorsMoving = false;
volatile bool manualMove = false;
bool debugAxisMovements = false;


volatile uint8_t axisState[MAX_STEPPER] = {0};
volatile uint8_t prev_axisState[MAX_STEPPER] = {0};

volatile int8_t sendUdpPacket = 0;
volatile int8_t udpRxPacket = 0;

