wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
volatile uint32_t udpPacketTxErrors = 0;
volatile uint32_t udpPacketRxErrors = 0;

volatile uint32_t inputInterruptCounter = 0;

volatile unsigned long ul_udptxrx_watchdog; /* Nothing RX/TX for 5s triggers watchdog clearing machine state */

uint8_t packetBufferTx[UDP_PACKET_BUF_SIZE]; // UDP buffer for sending data
uint8_t packetBufferRx[UDP_PACKET_BUF_SIZE]; // UDP buffer for receiving data


/*===============================================================================*/
/* TODO Warrants refactoring to use dynamic pin setup much like input pin config */

void IRAM_ATTR outputHandler()
{
    static int last_pwm[6] = { 0, 0, 0, 0, 0, 0 };

    bool enable = cmd.control & CTRL_ENABLE;

    if (pwm_enable[0]) {
        if (enable) {
            if (last_pwm[0] != cmd.pwm[0]) {
                last_pwm[0] = cmd.pwm[0];
                ledcWrite(0, last_pwm[0]);
            }
        } else {
            ledcWrite(0, 0);
            last_pwm[0] = 0;
        }
    } else {
        if (enable) {
            (cmd.io & IO_00) ? OUT_00_H : OUT_00_L;
        }
        else {
            OUT_00_L;
        }
    }

    if (pwm_enable[1]) {
        if (enable) {
            if (last_pwm[1] != cmd.pwm[1]) {
                last_pwm[1] = cmd.pwm[1];
                ledcWrite(2, last_pwm[1]);
            }
        } else {
            ledcWrite(2, 0);
            last_pwm[1] = 0;
        }
    } else {
        if (enable)
            (cmd.io & IO_01) ? OUT_01_H : OUT_01_L;
        else
            OUT_01_L;
    }

    if (pwm_enable[2]) {
        if (enable) {
            if (last_pwm[2] != cmd.pwm[2]) {
                last_pwm[2] = cmd.pwm[2];
                ledcWrite(4, last_pwm[2]);
            }
        } else {
            ledcWrite(4, 0);
            last_pwm[2] = 0;
        }
    } else {
        if (enable)
            (cmd.io & IO_02) ? OUT_02_H : OUT_02_L;
        else
            OUT_02_L;
    }

    if (pwm_enable[3]) {
        if (enable) {
            if (last_pwm[3] != cmd.pwm[3]) {
                last_pwm[3] = cmd.pwm[3];
                ledcWrite(6, last_pwm[3]);
            }
        } else {
            ledcWrite(6, 0);
            last_pwm[3] = 0;
        }
    } else {
        if (enable)
            (cmd.io & IO_03) ? OUT_03_H : OUT_03_L;
        else
            OUT_03_L;
    }

    if (pwm_enable[4]) {
        if (enable) {
            if (last_pwm[4] != cmd.pwm[4]) {
                last_pwm[4] = cmd.pwm[4];
                ledcWrite(8, last_pwm[4]);
            }
        } else {
            ledcWrite(8, 0);
            last_pwm[4] = 0;
        }
    } else {
        if (enable)
            (cmd.io & IO_04) ? OUT_04_H : OUT_04_L;
        else
            OUT_04_L;
    }

    if (pwm_enable[5]) {
        if (enable) {
            if (last_pwm[5] != cmd.pwm[5]) {
                last_pwm[5] = cmd.pwm[5];
                ledcWrite(10, last_pwm[5]);
            }
        } else {
            ledcWrite(10, 0);
            last_pwm[5] = 0;
        }
    } else {
        if (enable)
            (cmd.io & IO_05) ? OUT_05_H : OUT_05_L;
        else
            OUT_05_L;
    }
}
/*==================================================================*/
void IRAM_ATTR inputHandler()
{
    for (uint8_t i = 0; i < MAX_INPUTS; i++) {
        const struct inputPin_Config_s *pin_config = &inputPinsConfig[i];
        if (pin_config->gpio_number != GPIO_NUM_NC) {
            bool registerBitState = false;
            if (i == 0) {
                registerBitState = (bool)REG_GET_BIT(pin_config->register_address, pin_config->register_bit);
                (registerBitState) ? fb.io |= pin_config->fb_input_mask : fb.io = 0;
            }
            else {      
                registerBitState = (bool)REG_GET_BIT(pin_config->register_address, pin_config->register_bit);
                if (registerBitState)
                    fb.io |= pin_config->fb_input_mask;
            }
        } else { // If pin not connected
            if (i == 0) // if pinindex is 0
                fb.io = 0; // set initial fb.io value
        }
    }
}
/*==================================================================*/

void IRAM_ATTR commandHandler()
{
    if (cmd.control & CTRL_READY) {
        for (int i = 0; i < CONF_NUM_STEPPERS; i++) { // Placeholder if anything needs to occur at 1khz RTOS tick relating to motors
        }
    }

    if (prev_cmd_control != cmd.control) {
        logMessage("cmd.control = 0x%02x\r\n", cmd.control);
        
        if (cmd.control & CTRL_ENABLE) { // Called when Machine turned ON in LinuxCNC (Ready + Enable bits)
            logMessage("CMD: Machine ON\r\n");
            udp_tx_seq_num = 0;
            
            for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
                fb.vel[i] = 0;                
                stepper[i]->setCurrentPosition(cmd.pos[i]);
                stepper[i]->enableOutputs();
                stepper[i]->forceStopAndNewPosition(cmd.pos[i]);
                stepper[i]->setCurrentPosition(cmd.pos[i]);
            }
            motorsMoving = false;
            machineEnabled = true;
            inputHandler(); /* Run once to get current state and let ISR handle the rest */
        } else if ((cmd.control & CTRL_ENABLE) == 0) { // Called when Machine turned OFF in LinuxCNC (!Ready + Enable bits)
            logMessage("CMD: Machine OFF\r\n");
            
            motorsMoving = false;
            machineEnabled = false;
            udp_tx_seq_num = 0;
            
            for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
                fb.pos[i] = cmd.pos[i];
                stepper[i]->forceStop();
                stepper[i]->disableOutputs();               
                fb.vel[i] = 0;
                stepper[i]->setCurrentPosition(cmd.pos[i]);
            }
            inputHandler(); /* Run once to get current state and let ISR handle the rest */
            outputHandler();
        }

        prev_cmd_control = cmd.control;
    }
   
