wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
    if (!(fb.control & CTRL_READY)) {
        for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
            stepper[i]->disableOutputs();
        }
        if ((fb.control & CTRL_DIRSETUP)
            && (fb.control & CTRL_ACCEL)
            && (fb.control & CTRL_RESTORE)
            && (fb.control & CTRL_PWMFREQ)) {
            fb.control |= CTRL_READY;
            logMessage("Setting FB Control Ready\r\n");
            

        } else if (cmd.control & CTRL_DIRSETUP) {
            fb.control |= CTRL_DIRSETUP;
        } else if (cmd.control & CTRL_ACCEL) {
            fb.control |= CTRL_ACCEL;
            
            logMessage("CTRL_ACCEL\r\n");
            

            for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
                int newAccel = cmd.pos[i] * 2.0;
                logMessage("Setting stepper[%d] Accel to: %d\r\n", i, newAccel);
                stepper[i]->setAcceleration(newAccel);
            }
        } else if (cmd.control & CTRL_RESTORE) {
            fb.control |= CTRL_RESTORE;
            logMessage("CTRL_RESTORE\r\n");
            for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
                stepper[i]->setCurrentPosition(cmd.pos[i]);
                fb.pos[i] = cmd.pos[i];
            }

        } else if (cmd.control & CTRL_PWMFREQ) {
            fb.control |= CTRL_PWMFREQ;
            logMessage("Setup output pins\r\n");
            for (int i = 0; i < 6; i++) {
                if (cmd.pwm[i]) {
                    logMessage("Setup PWM output [%d]\r\n", i);
                    ledcAttachPin(pwm_pin[i], i * 2);
                    ledcSetup(i * 2, cmd.pwm[i], 10);
                    ledcWrite(i * 2, 0);
                    pwm_enable[i] = true;
                } else {
                    logMessage("Setup output [%d]\r\n", i);
                    if (i == 0) {
                        if (OUT_00_PIN != GPIO_NUM_NC) {
                            pinMode(OUT_00_PIN, OUTPUT);
                            digitalWrite(OUT_00_PIN, 0);
                        }
                    } else if (i == 1) {
                        if (OUT_01_PIN != GPIO_NUM_NC) {
                        pinMode(OUT_01_PIN, OUTPUT);
                        digitalWrite(OUT_01_PIN, 0);
                        }
                    } else if (i == 2) {
                        if (OUT_02_PIN != GPIO_NUM_NC) {
                            pinMode(OUT_02_PIN, OUTPUT);
                            digitalWrite(OUT_02_PIN, 0);
                        }
                    } else if (i == 3) {
                        if (OUT_03_PIN != GPIO_NUM_NC) {
                            pinMode(OUT_03_PIN, OUTPUT);
                            digitalWrite(OUT_03_PIN, 0);
                        }
                    } else if (i == 4) {
                        if (OUT_04_PIN != GPIO_NUM_NC) {
                            pinMode(OUT_04_PIN, OUTPUT);
                            digitalWrite(OUT_04_PIN, 0);
                        }
                    } else if (i == 5) {
                        if (OUT_05_PIN != GPIO_NUM_NC) {
                            pinMode(OUT_05_PIN, OUTPUT);
                            digitalWrite(OUT_05_PIN, 0);
                        }
                    }
                }
            }
        }
    }
}

/*==================================================================*/

void WiFiEvent(WiFiEvent_t event) 
{
    switch (event) {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        logMessage("WiFi IP: %s\r\n", WiFi.localIP().toString().c_str());
        break; 
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
        logMessage("WiFi Connected!\r\n");
        break; 
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        telnetDisconnectAllClients();
        logMessage("WiFi Disconnected!\r\n");
        break; 
#if CONFIG_IDF_TARGET_ESP32S2
#else
    case ARDUINO_EVENT_ETH_START:
        logMessage("Ethernet Started\r\n");
        ETH.setHostname("esp32-linuxcnc");
        break;
    case ARDUINO_EVENT_ETH_CONNECTED:
        logMessage("Ethernet Link UP\r\n");
        break;
    case ARDUINO_EVENT_ETH_GOT_IP:
        logMessage("Ethernet MAC: %s, IPv4: %s, %s Duplex, Speed: %dMbps\r\n", ETH.macAddress().c_str(), ETH.localIP().toString().c_str(), (ETH.fullDuplex()) ? "Full" : "Half",  ETH.linkSpeed());
        eth_connected = true;
        
        break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
        telnetDisconnectAllClients();
        logMessage("Ethernet Link DOWN\r\n");
        eth_connected = false;
        break;
    case ARDUINO_EVENT_ETH_STOP:
        logMessage("Ethernet Stopped\r\n");
        eth_connected = false;
        break;
#endif
    default:
        break;
    }
}


/*==================================================================*/
size_t IRAM_ATTR sendUDPFeedbackPacket() 
{
    bool result = true;
    memcpy(&packetBufferTx, &fb, sizeof(fb));
    size_t res = udpClient.write(packetBufferTx, sizeof(fb));
    if (res != sizeof(fb)) {
        udpPacketTxErrors++;
    }
    
    memset(packetBufferTx, 0, sizeof(packetBufferTx));
    sendUdpPacket--;
    if (sendUdpPacket < 0) {
        sendUdpPacket = 0;
    }
    
    udp_tx_seq_num++;
    
    return res;
}

void IRAM_ATTR onUDPRxPacketCallBack(AsyncUDPPacket packet)
{
    if (!runLoops)
        return;
    
    if (packet.length() > 0) {
        uint8_t chk = 71;
        for (int i = 0; i < sizeof(cmd); i++) {
            chk ^= packet.data()[i];
        }

        if (packet.data()[sizeof(cmd)] == chk) {
            udp_rx_seq_num++;
            memcpy(&cmd, packet.data(), sizeof(cmd));
            xEventGroupSetBits(xEventUdpReceiveGroup, UDP_RECEIVEPACKET_BIT);
        } else {
            udpPacketRxErrors++;
            if (udpPacketRxErrors > 1000) {
                logMessage("**ERROR**: Excessive UDP RX errors!. Size: %d, RxLen:%d\r\n", sizeof(cmd), packet.length());
                udpPacketRxErrors = 0;
            }
            return;
        }
        
        sendUdpPacket++;
    }           
}

void IRAM_ATTR loop_Core0_UDPSendTask(void* parameter)
{
    logMessage("loop_Core0_UDPSendTask running...\r\n");
    
    logMessage("UDP Send connect to IP: %s, Port: %d, Result: %d\r\n", ip_host.toString().c_str(), udpClientPort, udpClient.connect(ip_host,udpClientPort));
    size_t sent_len = 0;
    while (runLoops) {
        if (!udpClient.connected()) {
            logMessage("UDP Client unable to connect. Retrying in 5s\r\n");
            udpClient.connect(ip_host,udpClientPort);
            vTaskDelay(5000 / portTICK_PERIOD_MS);
        }
        
        while (sendUdpPacket > 0) {
            sent_len = sendUDPFeedbackPacket();
            if (sent_len == 0)
                break;
        }
        
        vTaskDelay(1 / portTICK_PERIOD_MS);
    }
    logMessage("Exiting loop_Core0_UDPSendTask\r\n");
    vTaskDelete(NULL);
}

/*==================================================================*/
void IRAM_ATTR inputPinChangeISR(void *args) 
{
    inputInterruptCounter++;
    int inputIndex = (int)args;
    xQueueSendFromISR(inputInterruptQueue, &inputIndex, NULL);
}

void IRAM_ATTR loop_Core0_InputPinHandlerTask(void * parameter) 
{
    logMessage("loop_Core0_InputPinHandlerTask running...\r\n");
    uint8_t inputIndex;
    while (runLoops) {
        if (xQueueReceive(inputInterruptQueue, &inputIndex, portMAX_DELAY))
        {
            const struct inputPin_Config_s *pin_config = &inputPinsConfig[inputIndex];

            /* Updates the fb.io struct with the GPIO register state from the inputPin_config struct data in Config.h */
            bool registerBitState = (bool)REG_GET_BIT(pin_config->register_address, pin_config->register_bit);
            (registerBitState) ? fb.io |= pin_config->fb_input_mask : fb.io &= ~pin_config->fb_input_mask;
            inputPinInterruptFired[inputIndex]++;

            if (inputPinInterruptFired[inputIndex] >= 50) {
                logMessage("WARNING: Excessive input changes. Index: %d, GPIO: %d, Name: '%s'. Changed %d times. Resetting counter\r\n", inputIndex, pin_config->gpio_number, pin_config->name, inputPinInterruptFired[inputIndex]);
                inputPinInterruptFired[inputIndex] = 0;
            }
            
            if (!motorsMoving) // Only send a udp feedback pkt if motors are stationary. When moving the feedback is done in realtime as per the fb.io struct
                sendUdpPacket++;
        }
    }
    logMessage("Exiting loop_Core0_InputPinHandlerTask\r\n");
    vTaskDelete(NULL);
}

/*==================================================================*/

void IRAM_ATTR loop_Core0_CommandHandlerTask(void* parameter)
{
    logMessage("loop_Core0_CommandHandlerTask running...\r\n");

    esp_task_wdt_delete(NULL); /* Disable the Task Watchdog (not core WD) for this task as the servo thread in FastAccelStepper can interfere with the it. No impact as the UDP packet based watchdog with catch any, if any, hung conditions */

    const EventBits_t xBitsToWaitFor  = (UDP_RECEIVEPACKET_BIT);
    EventBits_t xEventGroupValue;
    
    while(runLoops) {
        if (machineEnabled) { /* Handle UDP packet watchdog first */
            if (millis() - ul_udptxrx_watchdog > 5000) {
                logMessage("UDP Packet Watchdog triggered. Resetting machine state\r\n");
                fb.control = 0;
                cmd.control = 0;
                commandHandler();
                outputHandler();
                ul_udptxrx_watchdog = millis();
            }
        } else {
            ul_udptxrx_watchdog = millis();
        }
        /* Waits 50ms for an event from UDP packet from onUDPRxPacketCallBack(). Delay is only a few ticks if RX multiple packets */
        xEventGroupValue  = xEventGroupWaitBits(xEventUdpReceiveGroup, xBitsToWaitFor, pdTRUE, pdTRUE, portMAX_DELAY); 

        if((xEventGroupValue & UDP_RECEIVEPACKET_BIT) !=0) /* If UDP Packet RX bit is set */
        {          
            ul_udptxrx_watchdog = millis();
            
