wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
            commandHandler(); /* No need to process inputHandler() as they're interrupt driven and sent asynchronously in realtime on a separate task */
            
            if (machineEnabled) {
                outputHandler();
                
            } else {
                vTaskDelay(50 / portTICK_PERIOD_MS);
            }
        }
        xEventGroupClearBits(xEventUdpReceiveGroup, UDP_RECEIVEPACKET_BIT);
        /* No need for a vTaskDelay or yield context switch here since the event group delay above handles it */
    }

    logMessage("Exiting loop_Core0_CommandHandlerTask\r\n");
    vTaskDelete( NULL );
}

/*==================================================================*/

void IRAM_ATTR loop_Core1_ServoStatsTask(void* parameter) /* No need for IRAM since low speed background task */
{
    logMessage("loop_Core1_ServoStatsTask running...\r\n");

    while (runLoops) {
        if (serialConsoleEnabled) {
            long now_ProfileStats = millis();
            if (now_ProfileStats - lastMsg_ProfileStats > 1000) {
                logMessage("UDP: TX PPS: %d, RX PPS: %d, TX Errors: %d, RX Errors: %d, Input Interrupt Ctr: %d\r\n", udp_tx_seq_num, udp_rx_seq_num, udpPacketTxErrors, udpPacketRxErrors, inputInterruptCounter);
                udp_tx_seq_num = 0;
                udp_rx_seq_num = 0;
                inputInterruptCounter = 0;

                if (motorsSetup) {                
                    bool printStepperStats = false;
                    for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
                        if (stepper[i]->isRampGeneratorActive()) {
                            printStepperStats = true;
                            logMessage("Stepper[%d]: Pos Diff: %d, Freq Hz: %d, ", i, (cmd.pos[i] - fb.pos[i]), stepper[i]->getCurrentSpeedInMilliHz()/1000);
                        }
                    }
                    if (printStepperStats)
                        logMessage("\r\n");
                }
                
                lastMsg_ProfileStats = now_ProfileStats;
            }
        }

        if (debugAxisMovements) {
            uint8_t axisNum;
            if (xQueueReceive(axisStateInterruptQueue, &axisNum, 0))
            {
                debugAxisState(axisNum);
            }
            vTaskDelay(1); // No need to delay the task for 1000ms
        } else {
            vTaskDelay(800 / portTICK_PERIOD_MS); // Task Sleep 1000ms
        }
    }

    logMessage("Exiting loop_Core1_ServoStatsTask\r\n");
    vTaskDelete(NULL);

}


/*==================================================================*/

#ifdef DEBUG_AXIS_MOVEMENTS
void debugAxisState(uint8_t axisNum) {

    if (!debugAxisMovements)
        return;
    
    bool bitVals[8] = {false};

    for (uint8_t i = 0; i < CONF_NUM_STEPPERS; i++)
    {
        /* Quick and dirty for now... */
        for (uint8_t j = 0; j < 8; j++)
        {
            bitVals[j] = bitRead(axisState[i],j);
        }
        char active = (i==axisNum) ? '*' : '-';
        char req_move = (bitVals[0]) ? 'R' : 'S';
        char req_move_dir = (bitVals[1]) ? 'F' : 'R';
        char req_accel = (bitVals[2]) ? 'A' : 'D';
        char req_coast = (bitVals[3]) ? 'C' : '-';
        char actual_dir = (bitVals[4]) ? 'F' : 'R';
        char actual_accel = (bitVals[5]) ? 'A' : (bitVals[6]) ? 'D' : '-';
        char actual_coast = (bitVals[7]) ? 'C' : '-';

        /* 
            Prints out to bottom of serial console as axis stats are changing in real-time.
            See AXIS_STATE_* defines in Types

             <----  Active Axis Moving - [*] active, [-] not active
                <---- Axis Index
                   <---- Request stationary or running - [S] stopped, [R] running
                      <---- Request movement direction - [F] Forward, [R] Reverse
                        <---- Actual movement direction - [F] Forward, [R] Reverse
                           <---- Request acceleration - [A] Accelerate, [D] Decelerate
                             <---- Actual current ramp state - [A] Accelerate, [D] Decelerate
                                <---- Request velocity coasting - [C] Coasting/at full Speed, [-] Not coasting/at full speed
                                   <---- Actual velocity coasting - [C] Coasting/at full Speed, [-] Not coasting/at full speed
            [-][0] S: R|R, D|-, -|-
            [*][1] S: R|R, D|-, -|-
            [-][2] S: R|R, D|-, -|-
            
        */
        
        logMotorDebugMessage(i+1,"[%c][%d] %c: %c|%c, %c|%c, %c|%c", active, i, req_move, req_move_dir,actual_dir, req_accel,actual_accel, req_coast, actual_coast);
    }
    
}

void IRAM_ATTR updateAxisState(uint8_t axisNum, uint8_t mask ) {
    if (!debugAxisMovements)
        return;
    
    axisState[axisNum] = (mask);
    if (axisState[axisNum] != prev_axisState[axisNum]) {
        xQueueSendFromISR(axisStateInterruptQueue, &axisNum, NULL);    
        prev_axisState[axisNum] = axisState[axisNum];
    } 
}
void IRAM_ATTR updateAxisState(uint8_t axisNum, uint8_t bit, bool new_value ) {
    if (!debugAxisMovements)
        return;
    
    if (bit == AXIS_STATE_STOPPED && new_value == 1)
    {
        axisState[axisNum] = 0;
        xQueueSendFromISR(axisStateInterruptQueue, &axisNum, NULL);
        return;
    }

    if (new_value)
        axisState[axisNum] |= (bit);
    else
        axisState[axisNum] &= ~(bit);
    
    if (axisState[axisNum] != prev_axisState[axisNum]) {
        xQueueSendFromISR(axisStateInterruptQueue, &axisNum, NULL);    
        prev_axisState[axisNum] = axisState[axisNum];
    }    
}
#else
void debugAxisState(uint8_t currState) { }
void updateAxisState(uint8_t axisNum, uint8_t bit, bool new_value ) { }
#endif


/* FastAccellStepper Motor API movement command & feedback of position, accel and speed handled in single hardware timer. Non-blocking calls. Debug optional (slows cmd.pos queue fractionally )*/
void IRAM_ATTR ServoMovementCmds_ISR() 
{
    if (machineEnabled) {
        bool isMovementRunning = false;
        uint8_t moveResult = 0;
        
