wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
        /* 
            Uses the FastAccelStepper moveTo() command to ensure that any missed or out of sync UDP packets the position is always handled correctly. 
            Position is a 32bit integer of motor step position and not pulses and is accurate.
        */
        
        for (uint8_t i = 0; i < CONF_NUM_STEPPERS; i++) {
            uint32_t newVel = abs(cmd.vel[i]); // cmd.vel in milliHz positive int abs value
            uint32_t velLimit = 0;
            
            if (newVel > 0) { // Move is wanted (always a positive value regardless of direction)               
                velLimit = (abs(cmd.vel_limit[i])) / axisVelScaleFactor; // cmd.vel_limit in milliHz positive int abs value. Reduce by axisScalingFactor percent as per above
                
                const bool moveDir = cmd.vel[i] > 0 ? 1 : 0; // cmd.vel signed. Negative = reverse movement. Positive = forward movement.
                
                bool isRampActive = stepper[i]->isRampGeneratorActive();
                if (!isRampActive && newVel > 0) { // Initial move request ramping (stationary -> moving)
                    updateAxisState(i, AXIS_STATE_MOVE_REQ, 1);
                    (moveDir) ? updateAxisState(i, AXIS_STATE_MOVE_REQ_DIR, 1) : updateAxisState(i, AXIS_STATE_MOVE_REQ_DIR, 0);
                    stepper[i]->setLinearAcceleration(2000); // Initial linear acceleration but reduced to 100 once hits coasting speed
                    stepper[i]->setSpeedInMilliHz(newVel / axisVelScaleFactor); // Set to current axis velocity limit initially
                    updateAxisState(i, AXIS_STATE_MOVE_ACCEL_REQ, 1);
                } else if (isRampActive) { // rampGenerator is active so is already moving
                        newVel = newVel / axisVelScaleFactor;
                        const int32_t velDiff = (newVel - (abs(stepper[i]->getCurrentSpeedInMilliHz(true) / axisVelScaleFactor)));
                        if (velDiff > 10000 ) { // accelerating
                            stepper[i]->setLinearAcceleration(0); // Initial linear acceleration but reduced to 100 once hits coasting speed
                            stepper[i]->setSpeedInMilliHz(newVel); // Repeated call whilst moving to ensure changes in velocity is tracked accordingly.
                            updateAxisState(i, AXIS_STATE_MOVE_ACCEL_REQ, 1);
                        } else if (velDiff > -10000 ) { // decelerating but ignore anything less than -1000mHz
                            stepper[i]->setLinearAcceleration(0); // Initial linear acceleration but reduced to 100 once hits coasting speed
                            stepper[i]->setSpeedInMilliHz(newVel); // Repeated call whilst moving to ensure changes in velocity is tracked accordingly.
                            updateAxisState(i, AXIS_STATE_MOVE_ACCEL_REQ, 0);
                        } 
                        /*  Must ignore cmd.velocity state less than threshold, especially when decelerating downwards towards -5khz or below - 
                            this maintains existing vel value from the previous command to ensure motor stops in time without lag (UDP latencies)
                         */
                    
                }
                /* applySpeedAcceleration() not required. Performed during moveTo call */
                moveResult = stepper[i]->moveTo(cmd.pos[i], false); // Important non-blocking call, not in IRAM. cmd.pos includes LinuxCNC scale multiplier from HAL component to ensure correct steps per unit
            }

            /* For safety always check within loop to update a stationary axis regardless if moveTo is called or not */

            if (moveResult != MOVE_OK) {
                /* 
                    A failed moveTo() call will set the feedback position to the FastAccelStepper current motor position so it will throw a follower error in LinuxCNC if the library fails to generate any step pulses.
                    Tested & confirmed realtime position works using a physical machine with units and axis motor scaling set correctly. 
                    There are no steps lost during any jog steps, MDI commands or whilst running a job with adjusted feedrates
                    The following return codes can be used and added later for completeness sake
                    MOVE_ERR_NO_DIRECTION_PIN
                    MOVE_ERR_SPEED_IS_UNDEFINED
                    MOVE_ERR_ACCELERATION_IS_UNDEFINED
                */
                logMessage("Move Error %d for axis %d\r\n", moveResult, 0); // TODO WARNING Repeated calls to this could cause a crash
                fb.pos[i] = stepper[i]->getCurrentPosition();
                fb.vel[i] = stepper[i]->getCurrentSpeedInMilliHz(false);

            } else { // Moving success
                /*
                    See https://github.com/gin66/FastAccelStepper/blob/master/extras/doc/FastAccelStepper_API.md#stepper-position
                */
                
                if (stepper[i]->isRampGeneratorActive()) { /* Moving (fastest atomic call to the FAS lib to check if axis is moving) */
                    isMovementRunning = true;
                    
                    fb.pos[i] = stepper[i]->targetPos(); // Set cmd.pos to targetPos since it's where it will be after this movement in queue is complete
                    
                    uint8_t rampState = stepper[i]->rampState();
                    
                    if (rampState != prevRampState[i]) {
                        if (rampState & RAMP_STATE_ACCELERATE) {
                            updateAxisState(i, (AXIS_STATE_COASTING | AXIS_STATE_DECELERATING), 0);
                            updateAxisState(i, AXIS_STATE_ACCELERATING, 1);
                        } else if ((rampState & RAMP_STATE_COAST)) {
                            updateAxisState(i, (AXIS_STATE_DECELERATING | AXIS_STATE_ACCELERATING | AXIS_STATE_MOVE_ACCEL_REQ), 0);
                            updateAxisState(i, AXIS_STATE_COASTING, 1);
                            stepper[i]->setLinearAcceleration(100);
                            stepper[i]->applySpeedAcceleration();
                        } else if ((rampState & RAMP_STATE_DECELERATE)) {
                            updateAxisState(i, (AXIS_STATE_ACCELERATING | AXIS_STATE_COASTING), 0);
                            updateAxisState(i, AXIS_STATE_DECELERATING, 1);
                        }
                        if ((rampState & RAMP_DIRECTION_COUNT_UP)) {
                            updateAxisState(i, AXIS_STATE_MOVING_DIR, 1);
                        } else if ((rampState & RAMP_DIRECTION_COUNT_DOWN)) {
                            updateAxisState(i, AXIS_STATE_MOVING_DIR, 0);
                        }
                        prevRampState[i] = rampState;
                    }

