wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
                    fb.vel[i] = stepper[i]->getCurrentSpeedInMilliHz(true) * axisVelScaleFactor; // Update realtime feedback velocity using scaled value as the above. Ensuring a match with LinuxCNC is expecting for PID control aspects
                    
                } else { /* Motor stationary */
                    fb.pos[i] = stepper[i]->getCurrentPosition();
                    stepper[i]->setSpeedInMilliHz(0);
                    stepper[i]->applySpeedAcceleration();
                    fb.vel[i] = 0;
                    if (axisState[i] != 0) {
                        updateAxisState(i, AXIS_STATE_STOPPED, 1);
                    }
                }
            }
        }
        
        motorsMoving = isMovementRunning; /* Set globally - if ANY axes are moving */
    } else {
        motorsMoving = false; /* Set globally - Machine is currently disabled */
    }
}

/*==================================================================*/
/*================= Setup sections =================================*/

void setupInputPin(int inputIndex) /* See Config.h for inputPin board specific configurations */
{
    const struct inputPin_Config_s *pin_config = &inputPinsConfig[inputIndex];
    if (pin_config->gpio_number != GPIO_NUM_NC) {
        logMessage("INPUT[%d]: Configuring: '%s', GPIO: %d\r\n", inputIndex, pin_config->name, pin_config->gpio_number);
        pinMode(pin_config->gpio_number, pin_config->pin_mode);
        /* Use ESP-IDF gpio isr attachment as it allows to pass an argument to the ISR function (inputIndex)*/
        gpio_set_intr_type(pin_config->gpio_number, GPIO_INTR_ANYEDGE);
        gpio_isr_handler_add(pin_config->gpio_number, inputPinChangeISR, (void*)inputIndex);
    } else {
        logMessage("INPUT[%d] Config GPIO unconfigured\r\n", inputIndex);    
    }
}

void setup_Core0(void* parameter) /* Anything that wants to run on Core0 should be setup in this one-shot task */
{
    logMessage("setup_Core0()\r\n");

    xEventUdpReceiveGroup = xEventGroupCreate(); // Create event group
    inputInterruptQueue = xQueueCreate(30, sizeof(uint8_t)); // Create queue here

    logMessage("Starting Ethernet...\r\n");
#ifdef ESP32_RMII_ETHERNET
    
    #ifdef ARDUINO_ESP32_WT32_ETH01
        ETH.begin(1,16,23,18,ETH_PHY_LAN8720, ETH_CLOCK_GPIO0_IN, false);
    #elif defined(ARDUINO_ESP32_POE)
        ETH.begin(0,12,23,18,ETH_PHY_LAN8720, ETH_CLOCK_GPIO17_OUT, false);
    #elif defined(ARDUINO_ESP32_EVB)
        ETH.begin(0,-1,23,18,ETH_PHY_LAN8720, ETH_CLOCK_GPIO0_IN, false);
    #endif
    ETH.config(my_ip, gw, subnetmask);

#elif defined(ESP32SX_USB_ETHERNET)
#elif defined(ESP32_SPI_ETHERNET) 

    ESP32_W5500_onEvent();

    bool eth_result = ETH.begin( MISO_GPIO, MOSI_GPIO, SCK_GPIO, W5500_CS_PIN, W5500_INT_PIN, SPI_CLOCK_MHZ, ETH_SPI_HOST, (uint8_t*) mac );

    if (!eth_result)
        logMessage("**ERROR** SPI Ethernet could not be initialised. Please check wiring.\r\n");
    else
        ETH.config(my_ip, gw, subnetmask);
    
#endif
    delay(200);

    logMessage("Starting Telnet server on port 23\r\n");
    telnetServer.onClient(onTelnetClient, NULL);
    telnetServer.begin();
        
    if(udpServer.listen(my_ip, udpServerPort)) {
        logMessage("UDP Server Listening on IP: %s, Port: %d\r\n", my_ip.toString().c_str(), udpServerPort);
        udpServer.onPacket(onUDPRxPacketCallBack);
    } else {
        logMessage("**ERROR**: UDP Server failed to listen on IP: %s, Port: %d\r\n", my_ip.toString().c_str(), udpServerPort);
    }

    
    

    xTaskCreatePinnedToCore(
        loop_Core0_UDPSendTask, // Task function.
        "loop_Core0_UDPSendTask", // name of task.
        2048, // Stack size of task
        NULL, // parameter of the task
        6, // priority of the task
        NULL, // Task handle to keep track of created task
        0); // pin task to core 0

    xTaskCreatePinnedToCore(
        loop_Core0_InputPinHandlerTask, // Task function.
        "loop_Core0_InputPinHandlerTask", // name of task.
        2048, // Stack size of task
        NULL, // parameter of the task
        4, // priority of the task
        NULL, // Task handle to keep track of created task
        0); // pin task to core 0

    if (motorsSetup) {
        xTaskCreatePinnedToCore(
            loop_Core0_CommandHandlerTask, // Task function.
            "loop_Core0_CommandHandlerTask", // name of task.
            4096, // Stack size of task
            NULL, // parameter of the task
            5, // priority of the task
            NULL, // Task handle to keep track of created task
            0); // pin task to core 0
    }

    logMessage("Attaching hw timer for ServoMovementCmds ISR\r\n");
    
    timerServoCmds = timerBegin(3, 80, true);
    timerAttachInterrupt(timerServoCmds, &ServoMovementCmds_ISR, true);
    timerAlarmWrite(timerServoCmds, 500, true); // Runs faster than the pre-compiled 1khz FreeRTOS tick to ensure no movement command buffering issues
    timerAlarmEnable(timerServoCmds);  

    /* Must be done after Ethernet due to SPI interrupt global isr service install */
    logMessage("Configuring inputs...\r\n");
    
    for (uint8_t i = 0; i < MAX_INPUTS; i++) {
        setupInputPin(i);
    }

    logMessage("Core0 task setup complete\r\n");
    serialConsoleEnabled = true;
    vTaskDelete(NULL);
}

/*==================================================================*/

void stopProcessing() 
{
    if (runLoops) {
        logMessage("Stop Processing!\r\n");
        runLoops = false;
        for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
            stepper[i]->forceStop();
            stepper[i]->disableOutputs();
        }
        timerDetachInterrupt(timerServoCmds);
        timerStop(timerServoCmds);
        
        udpClient.close();
        udpServer.close();
        for (int i = 0; i < MAX_INPUTS; i++) {
            const struct inputPin_Config_s *pin_config = &inputPinsConfig[i];
            if (pin_config->gpio_number != GPIO_NUM_NC)
                detachInterrupt(pin_config->gpio_number);
        }

    } else {
        logMessage("Already stopped\r\n");
    }

