wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
}

void otaUpdateStart() 
{
    serialConsoleEnabled = true;
    logMessage("OTA Update Starting....\r\n");
    disableCore0WDT();
    disableCore1WDT();
    stopProcessing(); 
    
    logMessage("\r\n");
}

void otaUpdateEnd() 
{
    logMessage("OTA Update completed\r\n");
}

void otaProgress(unsigned int progress, unsigned int total) 
{
    logMessage("OTA Update Progress: %u%%\r", (progress / (total / 100)));
}

void parseTelnetMessage(AsyncClient* c, String message)
{   
    if (message.equals("r\r\n")) {
        logMessage("R key pressed. Restart..\r\n");
        telnetDisconnectAllClients();
        ESP.restart();
    } else if (message.equals("s\r\n")) {
        logMessage("S key pressed\r\n");
        stopProcessing();
    }   else if (message.equals("w\r\n")) {
        logMessage("W key pressed\r\n");
        if (WiFi.getMode() == WIFI_OFF) {
            setWifiState(WIFI_MODE_STA);
        } else {
            setWifiState(WIFI_OFF);
        }
    }   else if (message.equals("d\r\n")) {
        serialConsoleEnabled = !serialConsoleEnabled;
        logMessage("Serial Console: %d", serialConsoleEnabled);
    }
    
}

void telnetDisconnectAllClients() 
{
    if (telnetClientConnected > 0) {
        telnetClient->close();
        telnetClient = NULL;
        if (telnetClientConnected > 0)
            telnetClientConnected--;
    }
}

void onTelnetClientData(void *s, AsyncClient* c, void *buf, size_t len)
{
    char *str = static_cast<char*>(buf);
    if (len == 5) {
        if (memcmp(str, ctrlz_bytes, sizeof(ctrlz_bytes)) == 0)
        {
            telnetDisconnectAllClients();
        }
    }
    
    String rxMessage(str);
    parseTelnetMessage(c, rxMessage);
}

void onTelnetClientDisconnected(void *s, AsyncClient* c)
{
    if (telnetClientConnected > 0)
        telnetClientConnected--;
    telnetClient = NULL;
    logMessage("Telnet: client disconnected\r\n");
}

void onTelnetClient(void *s, AsyncClient* c) 
{
    telnetClientConnected++;
    telnetClient = c;
    c->onDisconnect(onTelnetClientDisconnected);
    c->onData(onTelnetClientData);
    IPAddress client_address = c->getRemoteAddress();
    logMessage("Telnet: '%s' client connected\r\n", client_address.toString().c_str() );
    String welcomeMsg = String("Welcome. Version: " + version_number + ". Ctrl+Z to quit\r\n");
    c->write("\eSP F");  // tell to use 7-bit control codes
    c->write("\e[?25l"); // hide cursor
    c->write("\e[?12l"); // disable cursor highlighting
    c->write(welcomeMsg.c_str());
}

/*==================================================================*/

////////////////////////////////////////////////////////
#ifdef ARDUINO_ESP32_MKS_DLC32
bool fasExternalCallForPin(uint8_t pin, uint8_t value) {
  // This example returns the previous value of the output.
  // Consequently, FastAccelStepper needs to call setExternalPin twice
  // in order to successfully change the output value.
  bool oldValue = digitalRead(pin);
  digitalWrite(pin, value);
  return oldValue;
}
#endif

bool setupMotors() 
{
    bool result = true;
    
    logMessage("Configuring motors\r\n");

    for (int i = 0; i < CONF_NUM_STEPPERS; i++) {
        cmd.vel[i] = 0;
        fb.vel[i] = 0;
    }
    
    stepperEngine.init(0); /* Use Core0 for stepper engine */
#ifdef ARDUINO_ESP32_MKS_DLC32
    stepperEngine.setExternalCallForPin(fasExternalCallForPin);
#endif
    for (uint8_t i = 0; i < CONF_NUM_STEPPERS; i++) {
        logMessage("Creating stepper %d\r\n", i);
        FastAccelStepper *s = NULL;
        const struct stepper_config_s *config = &stepper_config[i];
        if (config->step != PIN_UNDEFINED) {
            logMessage("configuring stepper %d\r\n", i);
#if CONFIG_IDF_TARGET_ESP32S2
            s = stepperEngine.stepperConnectToPin(config->step);
#else
            s = stepperEngine.stepperConnectToPin(config->step, DRIVER_RMT);
#endif
            if (s) {
                logMessage("attached stepper %d\r\n", i);
                s->setDirectionPin(config->direction, config->direction_high_count_up,
                                config->dir_change_delay);
                s->setEnablePin(config->enable_low_active, true);
                s->setEnablePin(config->enable_high_active, false);
                s->setAutoEnable(config->auto_enable);
                s->setDelayToEnable(config->on_delay_us);
                s->setDelayToDisable(config->off_delay_ms);
                s->setSpeedInHz(1000); /* Low inital values for safety */
                s->setAcceleration(1000); /* Low inital values for safety */
                s->applySpeedAcceleration();
                s->disableOutputs();
                
            } else {
                logMessage("**ERROR** Attaching stepper %d to RMT Driver\r\n", i);
                result = false;
            }
        }
        stepper[i] = s;
        logMessage("stepper %d created successfully\r\n", i);
    }
    return result;
}

void setWifiState(bool newState) {
    logMessage("Setting WiFi state: %d\r\n", newState);
    if (newState) {
        WiFi.mode(WIFI_MODE_STA); 
        WiFi.begin();
    }
    else
        WiFi.mode(WIFI_OFF); 
    
        
}

void setup()
{
    serialConsoleEnabled = true;
    //esp_log_level_set("*", ESP_LOG_VERBOSE);
#ifndef ESP32_SPI_ETHERNET // Only do this once and before everything if not using SPI ethernet. SPI ethernet driver installs this automatically
    gpio_install_isr_service(0);
#endif
    
    Serial.begin(BAUD_RATE);
    Serial.setDebugOutput(false);
    Serial.print("\eSP F");  // tell to use 7-bit control codes
    Serial.print("\e[?25l"); // hide cursor
    Serial.print("\e[?12l"); // disable cursor highlighting
    Serial.println();
    logMessage("Version: %s\r\n", version_number);
    logMessage("Setup started..\r\n");
    logMessage("APBFreq: %d\r\n", getApbFrequency());

    if (!setupMotors()){
        logMessage("**Error** setting up motors. Check motor pin mappings, input pin interrupt assignments and output pins do not overlap any motor pins\r\n");
        motorsSetup = false;
    } else {
        motorsSetup = true;
    }

