wezhunter/ESP32_LinuxCNC_MotionController_RealTime/src/main.cpp
    WiFi.onEvent(WiFiEvent); /* Always map networking event handler irrespective of WiFi enabled/disabled */

#ifdef ENABLE_WIFI
    /* WiFi Enabled */
        logMessage("Connecting to WiFi SSID: %s\r\n", CONF_WIFI_SSID);
        WiFi.begin(CONF_WIFI_SSID, CONF_WIFI_PWD);
        
        int connectCount = 0;
        while (WiFi.status() != WL_CONNECTED) {
            delay(500);
            connectCount++;
            if (connectCount > 10) {
                logMessage("Timeout for 5s whilst connecting to wifi network. Skipping...\r\n");
                break;
            }
        }
        
#else
    /* WiFi Disabled */
    WiFi.softAP("NULL","NULL123465",0,1,1); // WiFi needs to be enabled then disabled after Arduino OTA has been setup (lwip etc)
#endif
    
    ArduinoOTA.begin();  /* Enable OTA Service */
    ArduinoOTA.onStart(otaUpdateStart);
    ArduinoOTA.onEnd(otaUpdateEnd);
    ArduinoOTA.onProgress(otaProgress);
    
    WiFi.mode(WIFI_OFF); /* shutdown wifi */
#ifndef ENABLE_WIFI
    /* WiFi Disabled */
    WiFi.disconnect(true,false);  
    WiFi.mode(WIFI_OFF); /* shutdown wifi */
#endif
           

#ifdef ARDUINO_ESP32_MKS_DLC32
    i2s_out_init();
    //i2s_out_set_pulse_callback(stepper_pulse_func);
#endif
    axisStateInterruptQueue = xQueueCreate(30, sizeof(uint8_t)); // Create queue here

    runLoops = true; // Important to ensure background tasks exec in a loop

    
    xTaskCreatePinnedToCore(
        setup_Core0, // Task function.
        "setup_Core0Task", // name of task.
        4096, // Stack size of task
        NULL, // parameter of the task
        tskIDLE_PRIORITY, // priority of the task
        NULL, // Task handle to keep track of created task
        0); // pin task to core 0

#ifdef ENABLE_SERIAL_STATS
    /* For Debugging purposes - prints to serial port motor stats and UDP packet counters - Disable as required */
    xTaskCreatePinnedToCore(
        loop_Core1_ServoStatsTask, // Task function.
        "loop_Core1_ServoStatsTask", // name of task.
        2048, // Stack size of task
        NULL, // parameter of the task
        2, // priority of the task
        NULL, // Task handle to keep track of created task
        1); // pin task to core 1
#endif
    
    logMessage("Setup completed successfully\r\n");
}


/*==================================================================*/
void loop()
{
    if (eth_connected || WiFi.status() == WL_CONNECTED) {
        ArduinoOTA.handle();  // Handles a code update request
    }
#ifdef ENABLE_SERIAL_STATS
    /* Basic spinner on serial out to show MCU is still active */
    if (runLoops && serialConsoleEnabled) {
        if (spinProgress == 1) {
            spinChar = '\\';
        } else if (spinProgress == 2) {        
            spinChar = '|';
        } else if (spinProgress == 3) {
            spinChar = '/';
        } else {
            spinProgress = 0;
            spinChar = '-';
        }
        
        Serial.printf("\e[F\e[4A\e[0G%c\e[K\r\n\e[4B\e", spinChar);
        
        spinProgress++;
    }
    
#endif
    if (Serial.available() > 0) {
        byte incomingByte = Serial.read();
        if ((char) incomingByte == 'r') {
            logMessage("R key pressed. Restart..\r\n");
            telnetDisconnectAllClients();
            ESP.restart();
        } else if ((char) incomingByte == 's') {
            logMessage("S key pressed\r\n");
            stopProcessing();
        } else if ((char) incomingByte == 'w') {
            logMessage("W key pressed\r\n");
            if (WiFi.getMode() == WIFI_OFF) {
                setWifiState(WIFI_MODE_STA);
            } else {
                setWifiState(WIFI_OFF);
            }
        } else if ((char) incomingByte == 'm') {
            debugAxisMovements = !debugAxisMovements;
            logMessage("Debug Axis Movements: %d", debugAxisMovements);
        } else if ((char) incomingByte == 'd') {
            serialConsoleEnabled = !serialConsoleEnabled;
            logMessage("Serial Console: %d", serialConsoleEnabled);
        }
    
    

    }
 
    delay(250);
   
}
